app/controllers/users_controller.rb

INSERT INTO "users" ("email", "lastname", "firstname", "password_digest", "created_at", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    if @user.save